experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/nano-vllm__ragged.log
INFO 08-18 17:28:44 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 17:28:44 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 17:28:46 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 17:28:46 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x77b8e5bd87c0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0.75', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://nano-vllm:8001', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='nano-vllm__ragged.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-673cd1b5-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 17:28:49 [utils.py:90] Sampling input_len from [128, 896] and output_len from [128, 896]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  681.90    
Total input tokens:                      51917     
Total generated tokens:                  43889     
Request throughput (req/s):              0.15      
Output token throughput (tok/s):         64.36     
Peak output token throughput (tok/s):    72.00     
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          140.50    
---------------Time to First Token----------------
Mean TTFT (ms):                          310311.63 
Median TTFT (ms):                        322525.17 
P99 TTFT (ms):                           632827.65 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          130.31    
Median TPOT (ms):                        122.02    
P99 TPOT (ms):                           155.33    
---------------Inter-token Latency----------------
Mean ITL (ms):                           126.35    
Median ITL (ms):                         120.78    
P99 ITL (ms):                            247.52    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          363528.08 
Median E2EL (ms):                        389397.00 
P99 E2EL (ms):                           676251.64 
==================================================

--- stderr ---
W0818 17:28:45.166000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:00<00:57,  1.72it/s]
  2%|▏         | 2/100 [00:21<20:09, 12.34s/it]
  3%|▎         | 3/100 [00:23<12:15,  7.58s/it]
  4%|▍         | 4/100 [00:37<16:44, 10.46s/it]
  5%|▌         | 5/100 [00:45<14:39,  9.26s/it]
  6%|▌         | 6/100 [00:47<10:42,  6.83s/it]
  7%|▋         | 7/100 [00:50<08:50,  5.71s/it]
  8%|▊         | 8/100 [00:53<07:09,  4.67s/it]
  9%|▉         | 9/100 [01:29<21:57, 14.48s/it]
 10%|█         | 10/100 [01:30<15:33, 10.38s/it]
 11%|█         | 11/100 [01:35<13:11,  8.89s/it]
 12%|█▏        | 12/100 [01:37<09:57,  6.79s/it]
 13%|█▎        | 13/100 [01:49<12:06,  8.36s/it]
 14%|█▍        | 14/100 [01:56<11:25,  7.97s/it]
 15%|█▌        | 15/100 [01:59<08:56,  6.31s/it]
 16%|█▌        | 16/100 [02:02<07:37,  5.45s/it]
 17%|█▋        | 17/100 [02:07<07:08,  5.17s/it]
 18%|█▊        | 18/100 [02:21<10:41,  7.83s/it]
 19%|█▉        | 19/100 [02:25<08:56,  6.62s/it]
 20%|██        | 20/100 [02:29<08:01,  6.02s/it]
 21%|██        | 21/100 [02:50<13:51, 10.53s/it]
 22%|██▏       | 22/100 [02:57<12:21,  9.51s/it]
 23%|██▎       | 23/100 [03:11<13:46, 10.74s/it]
 24%|██▍       | 24/100 [03:13<10:09,  8.03s/it]
 25%|██▌       | 25/100 [03:20<09:47,  7.83s/it]
 26%|██▌       | 26/100 [03:24<08:23,  6.81s/it]
 27%|██▋       | 27/100 [03:42<12:01,  9.88s/it]
 28%|██▊       | 28/100 [03:42<08:31,  7.10s/it]
 29%|██▉       | 29/100 [03:43<06:12,  5.24s/it]
 30%|███       | 30/100 [03:46<05:16,  4.52s/it]
 31%|███       | 31/100 [03:47<04:01,  3.50s/it]
 32%|███▏      | 32/100 [03:51<03:58,  3.51s/it]
 33%|███▎      | 33/100 [04:01<06:14,  5.59s/it]
 34%|███▍      | 34/100 [04:08<06:44,  6.13s/it]
 35%|███▌      | 35/100 [04:14<06:27,  5.97s/it]
 36%|███▌      | 36/100 [04:35<11:12, 10.51s/it]
 37%|███▋      | 37/100 [04:37<08:25,  8.03s/it]
 38%|███▊      | 38/100 [04:39<06:26,  6.24s/it]
 39%|███▉      | 39/100 [04:55<09:19,  9.17s/it]
 40%|████      | 40/100 [05:09<10:29, 10.50s/it]
 41%|████      | 41/100 [05:11<07:46,  7.91s/it]
 42%|████▏     | 42/100 [05:14<06:17,  6.51s/it]
 43%|████▎     | 43/100 [05:30<08:45,  9.22s/it]
 44%|████▍     | 44/100 [05:31<06:32,  7.01s/it]
 45%|████▌     | 45/100 [05:35<05:26,  5.93s/it]
 46%|████▌     | 46/100 [05:44<06:14,  6.93s/it]
 47%|████▋     | 47/100 [05:47<05:08,  5.82s/it]
 48%|████▊     | 48/100 [05:57<06:07,  7.07s/it]
 49%|████▉     | 49/100 [06:12<08:03,  9.47s/it]
 50%|█████     | 50/100 [06:24<08:31, 10.23s/it]
 51%|█████     | 51/100 [06:33<08:02,  9.84s/it]
 52%|█████▏    | 52/100 [06:35<05:49,  7.27s/it]
 53%|█████▎    | 53/100 [06:35<04:01,  5.13s/it]
 54%|█████▍    | 54/100 [06:39<03:48,  4.98s/it]
 55%|█████▌    | 55/100 [06:43<03:19,  4.44s/it]
 56%|█████▌    | 56/100 [06:49<03:47,  5.17s/it]
 57%|█████▋    | 57/100 [06:52<03:02,  4.25s/it]
 58%|█████▊    | 58/100 [06:52<02:14,  3.21s/it]
 59%|█████▉    | 59/100 [06:56<02:21,  3.45s/it]
 60%|██████    | 60/100 [07:00<02:17,  3.45s/it]
 61%|██████    | 61/100 [07:03<02:11,  3.36s/it]
 62%|██████▏   | 62/100 [07:11<03:03,  4.84s/it]
 63%|██████▎   | 63/100 [07:22<04:09,  6.73s/it]
 64%|██████▍   | 64/100 [07:33<04:47,  7.99s/it]
 65%|██████▌   | 65/100 [07:34<03:24,  5.83s/it]
 66%|██████▌   | 66/100 [07:50<05:03,  8.93s/it]
 67%|██████▋   | 67/100 [07:54<03:59,  7.27s/it]
 68%|██████▊   | 68/100 [08:09<05:08,  9.64s/it]
 69%|██████▉   | 69/100 [08:19<05:02,  9.76s/it]
 70%|███████   | 70/100 [08:24<04:08,  8.28s/it]
 71%|███████   | 71/100 [08:34<04:17,  8.86s/it]
 72%|███████▏  | 72/100 [08:35<03:03,  6.55s/it]
 73%|███████▎  | 73/100 [08:58<05:08, 11.43s/it]
 74%|███████▍  | 74/100 [08:58<03:29,  8.05s/it]
 75%|███████▌  | 75/100 [09:00<02:36,  6.27s/it]
 76%|███████▌  | 76/100 [09:01<01:52,  4.69s/it]
 77%|███████▋  | 77/100 [09:08<02:03,  5.36s/it]
 78%|███████▊  | 78/100 [09:09<01:27,  3.99s/it]
 79%|███████▉  | 79/100 [09:11<01:14,  3.56s/it]
 80%|████████  | 80/100 [09:15<01:13,  3.67s/it]
 81%|████████  | 81/100 [09:24<01:38,  5.20s/it]
 83%|████████▎ | 83/100 [09:33<01:23,  4.93s/it]
 84%|████████▍ | 84/100 [09:39<01:22,  5.17s/it]
 85%|████████▌ | 85/100 [09:43<01:10,  4.69s/it]
 86%|████████▌ | 86/100 [09:48<01:09,  4.99s/it]
 87%|████████▋ | 87/100 [09:51<00:55,  4.30s/it]
 88%|████████▊ | 88/100 [10:01<01:12,  6.00s/it]
 89%|████████▉ | 89/100 [10:03<00:53,  4.83s/it]
 90%|█████████ | 90/100 [10:06<00:41,  4.19s/it]
 91%|█████████ | 91/100 [10:32<01:36, 10.74s/it]
 92%|█████████▏| 92/100 [10:33<01:01,  7.66s/it]
 93%|█████████▎| 93/100 [10:43<00:58,  8.36s/it]
 94%|█████████▍| 94/100 [10:51<00:49,  8.25s/it]
 95%|█████████▌| 95/100 [11:02<00:45,  9.06s/it]
 96%|█████████▌| 96/100 [11:14<00:40, 10.20s/it]
 97%|█████████▋| 97/100 [11:15<00:21,  7.28s/it]
 98%|█████████▊| 98/100 [11:15<00:10,  5.28s/it]
 99%|█████████▉| 99/100 [11:16<00:03,  3.77s/it]
100%|██████████| 100/100 [11:21<00:00,  4.35s/it]
100%|██████████| 100/100 [11:21<00:00,  6.82s/it]